ArduPilot/ChibiOS.svn/tools/embsysregviewdata/data/ARM_Cortex-M3/ADI/ADuCM360.xml
<?xml version="1.0" encoding="utf-8" ?>
<device schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD_Schema_1_1.xsd">
    <vendor>Analog Devices</vendor>
    <vendorID>ADI</vendorID>
	<name>ADuCM360</name>
	<version>0.7</version>
	<description>Cortex-M3 Microcontroller Device</description>
	<addressUnitBits>8</addressUnitBits>
	<width>32</width>
	<series>ARMCM3</series>
	<!-- Register Default Properties -->
	<!-- the size of the registers is set to a bit width of 32. This can be overruled for individual peripherals and/or registers -->
	<size>32</size>
	<!-- the access to all registers is set to be readable and writeable. This can be overruled for individual peripherals and/or registers -->
	<access>read-write</access>
	<!-- for demonstration purposes the resetValue for all registers of the device is set to be 0. This can be overruled within the description -->
	<resetValue>0</resetValue>
	<!-- the resetMask = 0 specifies that by default no register of this device has a defined reset value -->
	<resetMask>0</resetMask>
	<cpu>
		<name>CM3</name>
		<revision>r2p0</revision>
		<endian>little</endian>
		<mpuPresent>false</mpuPresent>
		<fpuPresent>false</fpuPresent>
		<nvicPrioBits>3</nvicPrioBits>
		<vendorSystickConfig>false</vendorSystickConfig>
	</cpu>
	<peripherals>
		<peripheral>
			<name>ADI_T0</name>
			<description>Timer 0</description>
			<groupName>T0</groupName>
			<baseAddress>0x40000000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>TIMER0</name>
				<value>11</value>
			</interrupt>
			<registers>
				<register>
					<name>T0LD</name>
					<addressOffset>0x00000000</addressOffset>
					<size>0x00000010</size>
					<description>16-bit load value</description>
					<fields>
						<field>
							<name>VALUE</name>
							<description>Load value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>T0VAL</name>
					<addressOffset>0x00000004</addressOffset>
					<size>0x00000010</size>
					<description>16-bit timer value, read only.</description>
					<fields>
						<field>
							<name>VALUE</name>
							<description>Current value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>T0CON</name>
					<addressOffset>0x00000008</addressOffset>
					<size>0x00000010</size>
					<description>Control Register</description>
					<fields>
						<field>
							<name>EVENTEN</name>
							<description>Enable time capture of an event</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EVENT</name>
							<description>Event Select, selects 1 of the available events.</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>T2</name>
									<value>0</value>
									<description>- Wakeup Timer</description>
								</enumeratedValue>
								<enumeratedValue>
									<name>EXT0</name>
									<value>1</value>
									<description>- External interrupt 0</description>
								</enumeratedValue>
								<enumeratedValue>
									<name>EXT1</name>
									<value>2</value>
									<description>- External interrupt 1</description>
								</enumeratedValue>
								<enumeratedValue>
									<name>EXT2</name>
									<value>3</value>
									<description>- External interrupt 2</description>
								</enumeratedValue>
								<enumeratedValue>
									<name>EXT3</name>
									<value>4</value>
									<description>- External interrupt 3</description>
								</enumeratedValue>
								<enumeratedValue>
									<name>EXT4</name>
									<value>5</value>
									<description>- External interrupt 4</description>
								</enumeratedValue>
								<enumeratedValue>
									<name>EXT5</name>
									<value>6</value>
									<description>- External interrupt 5</description>
								</enumeratedValue>
								<enumeratedValue>
									<name>EXT6</name>
									<value>7</value>
									<description>- External interrupt 6</description>
								</enumeratedValue>
								<enumeratedValue>
									<name>EXT7</name>
									<value>8</value>
									<description>- External interrupt 7</description>
								</enumeratedValue>
								<enumeratedValue>
									<name>T3</name>
									<value>9</value>
									<description>- Watchdog timer</description>
								</enumeratedValue>
								<enumeratedValue>
									<name>T1</name>
									<value>10</value>
									<description>- Timer1</description>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADC0</name>
									<value>11</value>
									<description>- ADC0</description>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADC1</name>
									<value>12</value>
									<description>- ADC1</description>
								</enumeratedValue>
								<enumeratedValue>
									<name>STEP</name>
									<value>13</value>
									<description>- STEP</description>
								</enumeratedValue>
								<enumeratedValue>
									<name>DMADONE</name>
									<value>14</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FEE</name>
									<value>15</value>
									<description>- Flash controller</description>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RLD</name>
							<description>Timer reload on write to clear register</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CLK</name>
							<description>Clock Select</description>
							<bitOffset>5</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>UCLK</name>
									<value>0</value>
									<description>- System Clock</description>
								</enumeratedValue>
								<enumeratedValue>
									<name>PCLK</name>
									<value>1</value>
									<description>- Peripheral clock</description>
								</enumeratedValue>
								<enumeratedValue>
									<name>LFOSC</name>
									<value>2</value>
									<description>- Internal 32 kHz Oscillator</description>
								</enumeratedValue>
								<enumeratedValue>
									<name>LFXTAL</name>
									<value>3</value>
									<description>- External 32 kHz crystal</description>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ENABLE</name>
							<description>Enable</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MOD</name>
							<description>Mode</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>FREERUN</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PERIODIC</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>UP</name>
							<description>Count-up</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PRE</name>
							<description>Prescaler</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIV1</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV16</name>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV256</name>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV32768</name>
									<value>3</value>
									<description>- If the selected clock source is UCLK then this setting results in a prescaler of 4.</description>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>T0CLRI</name>
					<addressOffset>0x0000000C</addressOffset>
					<size>0x00000010</size>
					<description>Clear interrupt register</description>
					<fields>
						<field>
							<name>CAP</name>
							<description>Clear captured event interrupt</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TMOUT</name>
							<description>Clear timeout interrupt</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>T0CAP</name>
					<addressOffset>0x00000010</addressOffset>
					<size>0x00000010</size>
					<description>Capture Register</description>
					<fields>
						<field>
							<name>VALUE</name>
							<description>Capture value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>T0STA</name>
					<addressOffset>0x0000001C</addressOffset>
					<size>0x00000010</size>
					<description>Status Register</description>
					<fields>
						<field>
							<name>CLRI</name>
							<description>Value updated in the timer clock domain</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CON</name>
							<description>Ready to receive commands</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CAP</name>
							<description>Capture event pending</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TMOUT</name>
							<description>Time out event occurred</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
