ArduPilot/ChibiOS.svn/tools/embsysregviewdata/data/ARM_Cortex-M3/ADI/ADuCM360.xml
			</registers>
		</peripheral>
		<peripheral>
			<name>ADI_WUT</name>
			<description>WakeUp Timer</description>
			<groupName>WUT</groupName>
			<baseAddress>0x40002500</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x44</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>T2VAL0</name>
					<addressOffset>0x00000000</addressOffset>
					<size>0x00000010</size>
					<description>Current count value LSB</description>
					<fields>
						<field>
							<name>VALUE</name>
							<description>Current Value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>T2VAL1</name>
					<addressOffset>0x00000004</addressOffset>
					<size>0x00000010</size>
					<description>Current count value MSB</description>
					<fields>
						<field>
							<name>VALUE</name>
							<description>Current Value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>T2CON</name>
					<addressOffset>0x00000008</addressOffset>
					<size>0x00000010</size>
					<description>Control Register</description>
					<fields>
						<field>
							<name>STOPINC</name>
							<description>Stop wake up field A being updated</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CLK</name>
							<description>Clock</description>
							<bitOffset>9</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>PCLK</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LFXTAL</name>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LFOSC</name>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EXTCLK</name>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WUEN</name>
							<description>WUEN</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ENABLE</name>
							<description>Enable</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MOD</name>
							<description>Mode</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>PERIODIC</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FREERUN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FREEZE</name>
							<description>Freeze</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PRE</name>
							<description>Prescaler</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIV1</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV16</name>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV256</name>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV32768</name>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>T2INC</name>
					<addressOffset>0x0000000C</addressOffset>
					<size>0x00000010</size>
					<description>12-bit register. Wake up field A</description>
					<fields>
						<field>
							<name>VALUE</name>
							<description>12 bit value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>12</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>T2WUFB0</name>
					<addressOffset>0x00000010</addressOffset>
					<size>0x00000010</size>
					<description>Wake up field B  LSB</description>
					<fields>
						<field>
							<name>VALUE</name>
							<description>Current Value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>T2WUFB1</name>
					<addressOffset>0x00000014</addressOffset>
					<size>0x00000010</size>
					<description>Wake up field B  MSB</description>
					<fields>
						<field>
							<name>VALUE</name>
							<description>Current Value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>T2WUFC0</name>
					<addressOffset>0x00000018</addressOffset>
					<size>0x00000010</size>
					<description>Wake up field C  LSB</description>
					<fields>
						<field>
							<name>VALUE</name>
							<description>Current Value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>T2WUFC1</name>
					<addressOffset>0x0000001C</addressOffset>
					<size>0x00000010</size>
					<description>Wake up field C  MSB</description>
					<fields>
						<field>
							<name>VALUE</name>
							<description>Current Value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>T2WUFD0</name>
					<addressOffset>0x00000020</addressOffset>
					<size>0x00000010</size>
					<description>Wake up field D  LSB</description>
					<fields>
						<field>
							<name>VALUE</name>
							<description>Current Value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>T2WUFD1</name>
					<addressOffset>0x00000024</addressOffset>
					<size>0x00000010</size>
					<description>Wake up field D  MSB</description>
					<fields>
						<field>
							<name>VALUE</name>
							<description>Current Value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>T2IEN</name>
					<addressOffset>0x00000028</addressOffset>
					<size>0x00000010</size>
					<description>Interrupt enable</description>
					<fields>
						<field>
							<name>ROLL</name>
							<description>Enable interrupt on Rollover</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WUFD</name>
							<description>Enable interrupt on WUFD</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WUFC</name>
							<description>Enable interrupt on WUFC</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WUFB</name>
							<description>Enable interrupt on WUFB</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WUFA</name>
							<description>Enable interrupt on WUFA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>T2STA</name>
					<addressOffset>0x0000002C</addressOffset>
					<size>0x00000010</size>
					<description>Status</description>
					<fields>
						<field>
							<name>CON</name>
							<description>Sync</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FREEZE</name>
							<description>Timer Value Freeze</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ROLL</name>
							<description>Rollover Interrupt</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WUFD</name>
							<description>WUFD Interrupt</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WUFC</name>
							<description>WUFC Interrupt</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WUFB</name>
							<description>WUFB Interrupt</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WUFA</name>
							<description>WUFA Interrupt</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>T2CLRI</name>
					<addressOffset>0x00000030</addressOffset>
					<size>0x00000010</size>
					<description>Clear interrupts. Write only.</description>
					<fields>
						<field>
							<name>ROLL</name>
							<description>Clear interrupt on Rollover</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WUFD</name>
							<description>Clear interrupt on WUFD</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WUFC</name>
							<description>Clear interrupt on WUFC</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WUFB</name>
							<description>Clear interrupt on WUFB</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WUFA</name>
							<description>Clear interrupt on WUFA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>T2WUFA0</name>
					<addressOffset>0x0000003C</addressOffset>
					<size>0x00000010</size>
					<description>Wake up field A  LSB.</description>
					<fields>
						<field>
							<name>VALUE</name>
							<description>Current Value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>T2WUFA1</name>
					<addressOffset>0x00000040</addressOffset>
					<size>0x00000010</size>
					<description>Wake up field A MSB.</description>
					<fields>
						<field>
							<name>VALUE</name>
							<description>Current Value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
