ArduPilot/ChibiOS.svn/tools/embsysregviewdata/data/ARM_Cortex-M3/ADI/ADuCM360.xml
			</registers>
		</peripheral>
		<peripheral>
			<name>ADI_ADC0</name>
			<description>Analog to Digital Converter</description>
			<groupName>ADC0</groupName>
			<baseAddress>0x40030000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x4C</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>ADC0</name>
				<value>13</value>
			</interrupt>
			<registers>
				<register>
					<name>ADC0STA</name>
					<addressOffset>0x00000000</addressOffset>
					<size>0x00000008</size>
					<description>ADC Status register</description>
					<fields>
						<field>
							<name>CAL</name>
							<description>ADC Calibration status register</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ERR</name>
							<description>ADC conversion error status bit.</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ATHEX</name>
							<description>ADC Accumulator Comparator Threshold status bit.</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>THEX</name>
							<description>ADC comparator threshold.</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OVR</name>
							<description>ADC overrange bit.</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RDY</name>
							<description>valid conversion result</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>ADC0MSKI</name>
					<addressOffset>0x00000004</addressOffset>
					<size>0x00000008</size>
					<description>Interrupt control register</description>
					<fields>
						<field>
							<name>ATHEX</name>
							<description>ADC Accumulator Comparator Threshold status bit mask</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>THEX</name>
							<description>ADC comparator threshold mask</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OVR</name>
							<description>ADC overrange bit mask.</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RDY</name>
							<description>valid conversion result mask</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>ADC0CON</name>
					<addressOffset>0x00000008</addressOffset>
					<size>0x00000020</size>
					<description>Main control register</description>
					<fields>
						<field>
							<name>ADCEN</name>
							<description>Enable Bit</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADCCODE</name>
							<description>ADC Output Coding bits</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>INT</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>UINT</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BUFPOWN</name>
							<description>Negative buffer power down</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
									<description>Disable powerdown - Negative buffer is enabled</description>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
									<description>Enable powerdown - Negative buffer is disabled</description>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BUFPOWP</name>
							<description>Positive buffer power down</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
									<description>Disable powerdown - Positive buffer is enabled</description>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
									<description>Enable powerdown - Positive buffer is disabled</description>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BUFBYPP</name>
							<description>Positive buffer bypass</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BUFBYPN</name>
							<description>Negative buffer bypass</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADCREF</name>
							<description>Reference selection</description>
							<bitOffset>12</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>INTREF</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EXTREF</name>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EXTREF2</name>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AVDDREF</name>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADCDIAG</name>
							<description>Diagnostic Current bits bits</description>
							<bitOffset>10</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIAG_OFF</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIAG_POS</name>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIAG_NEG</name>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIAG_ALL</name>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADCCP</name>
							<description>AIN+ bits</description>
							<bitOffset>5</bitOffset>
							<bitWidth>5</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>AIN0</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN1</name>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN2</name>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN3</name>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN4</name>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN5</name>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN6</name>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN7</name>
									<value>7</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN8</name>
									<value>8</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN9</name>
									<value>9</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN10</name>
									<value>10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN11</name>
									<value>11</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DAC</name>
									<value>12</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AVDD4</name>
									<value>13</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>IOVDD4</name>
									<value>14</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AGND</name>
									<value>15</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TEMP</name>
									<value>16</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADCCN</name>
							<description>AIN- bits</description>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>AIN0</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN1</name>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN2</name>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN3</name>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN4</name>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN5</name>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN6</name>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN7</name>
									<value>7</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN8</name>
									<value>8</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN9</name>
									<value>9</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN10</name>
									<value>10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN11</name>
									<value>11</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DAC</name>
									<value>12</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AGND</name>
									<value>15</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TEMP</name>
									<value>17</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>ADC0OF</name>
					<addressOffset>0x0000000C</addressOffset>
					<size>0x00000010</size>
					<description>Offset calibration register</description>
					<fields>
						<field>
							<name>VALUE</name>
							<description>Offset</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>ADC0INTGN</name>
					<addressOffset>0x00000010</addressOffset>
					<size>0x00000010</size>
					<description>Gain calibration register when using internal reference</description>
					<fields>
						<field>
							<name>VALUE</name>
							<description>Gain with Int Ref</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>ADC0EXTGN</name>
					<addressOffset>0x00000014</addressOffset>
					<size>0x00000010</size>
					<description>Gain calibration register when using external reference</description>
					<fields>
						<field>
							<name>VALUE</name>
							<description>Gain with Ext Ref</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>ADC0VDDGN</name>
					<addressOffset>0x00000018</addressOffset>
					<size>0x00000010</size>
					<description>Gain calibration register when using AVDD as the ADC reference</description>
					<fields>
						<field>
							<name>VALUE</name>
							<description>Gain with Avdd Ref</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>ADCCFG</name>
					<addressOffset>0x0000001C</addressOffset>
					<size>0x00000010</size>
					<description>Control register for the VBIAS voltage generator, ground switch and external reference buffer</description>
					<fields>
						<field>
							<name>SIMU</name>
							<description>Enable both ADCs</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BOOST30</name>
							<description>Boost the Vbias current source ability by 30 times</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PINSEL</name>
							<description>Enable vbias generator, send vbias to selected ain pin bits</description>
							<bitOffset>8</bitOffset>
							<bitWidth>3</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
									<description>Disable VBIAS generator</description>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN7</name>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN11</name>
									<value>6</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GNDSWON</name>
							<description>GND_SW</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GNDSWRESEN</name>
							<description>20k resistor in series with GND_SW</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXTBUF</name>
							<description>Control signals for ext_ref buffers bits</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>OFF</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>VREFPN</name>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>VREFP_VREF2P</name>
									<value>2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>ADC0FLT</name>
					<addressOffset>0x00000020</addressOffset>
					<size>0x00000010</size>
					<description>Filter configuration register</description>
					<fields>
						<field>
							<name>CHOP</name>
							<description>Enables System-Chopping bits</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>OFF</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ON</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RAVG2</name>
							<description>Enables a running Average-By-2 bits</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>OFF</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ON</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SINC4EN</name>
							<description>Enable the Sinc4 filter instead of Sinc3 filter.</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>AF</name>
							<description>Averaging filter</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>NOTCH2</name>
							<description>Inserts a notch at FNOTCH2</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SF</name>
							<description>SINC Filter value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>7</bitWidth>
						</field>
					</fields>
				</register>
